{"additions": 304, "auther_ref": "dev-dataCatalog-1-forPR", "auther_sha": "20b1cff5012e682260a4939166b7d40b11a1c4e3", "author": "nhduongvn", "body": "#### PR description:\r\n\r\nThis request proposes code changes to use multiple data catalogs listed in site-local-config.xml. Previously, the site-local-config.xml contains twe data catalogs, primary fallback ones. These are parsed and used by CMSSW using dedicated methods and functions. \r\n\r\nThe idea is to add a pfns_ variable to FileCatalogItem class (FWCore/Catalog/interface/InputFileCatalog.h ), to store all the physical file names. Each of them corresponds to a data catalog. The collection of data catalogs is returned by SiteLocalConfigService. After this, the RootInputFileSequence (IOPool/Input/src/RootInputFileSequence.h) class can try the file opening using multiples file names in initTheFileDataCatalogs of RootInputFileSequence. It just loops over PFN file names constructed from different data catalogs until finding success or running out of options. Based on this RootInputFileSequence, a derived file sequence, for example, RootPrimaryFileSequence, can initiate the file with multiple data catalogs in RootPrimaryFileSequence::initFile_(bool skipBadFiles).\r\n\r\nCurrently, the code changes are backward compatible. There are flags setUseMultipleDataCatalogs in\r\nFWCore/Catalog/interface/InputFileCatalog.h and useMultipleDataCatalogs_ in RootPrimaryFileSequence. If setUseMultipleDataCatalogs is false, default codes will run. If useMultipleDataCatalogs_ is false the RootPrimaryFileSequence will use primary and fallback data catalogs as usual.\r\n\r\nIn the future, the usage of fallback data catalog in CMSSW will be replaced by multiple data catalogs.\r\n\r\n#### PR validation:\r\n\r\nThe file access in PoolSource is validated.", "branch": "master", "changed_files": 12, "comments": 30, "commits": 12, "created_at": "1581352350", "deletions": 14, "labels": ["code-checks-approved", "comparison-pending", "core-pending", "orp-pending", "pending-signatures", "tests-pending"], "milestone": "CMSSW_11_1_X", "number": 28911, "release-notes": [], "review_comments": 0, "state": "open", "title": "New developments using multiple data catalogs provided in site-local-config.xml", "updated_at": "1582216283", "user": "nhduongvn"}