{"additions": 2774, "auther_ref": "dqm-tools-and-header-changes", "auther_sha": "2b4cc77f151a02b5c81a80127d013af40e2f1171", "author": "schneiml", "body": "#### PR description:\r\n\r\nThis PR contains two things:\r\n- A lot of automated changes to the `#include`'s in DQM code, to not explicitly refer to soon-to-be-remove or redundant header files. This is not all complete, but it should keep the future PRs smaller and avoid conflicts. There are some manual changes required, which is why I'd prefer to not do this migration again.\r\n- A set of automated refactoring tools, that I included simply because this is the first PR made using them [1]. They don't really need to go into any release, but might be useful to others (also makes my life easier).\r\n\r\nEventually, there will be a PR integrating the changes produced by the other tools, but for that to happen, we first need to implement the required code in `DQMServices/Core`...\r\n\r\nI am wondering how we should move forward with the formatting changes, I could (might be required to?) include a large batch of them here.\r\n \r\n#### PR validation:\r\n\r\nNone so far, but things compile, and none of the changes should affect the behavior of the code.\r\n\r\nI'd like to raise special attention to 38e9f49, which as far as I see, should not be required, yet, without it, I got a compilation error. Could this be a bug/incorrect use of scram (@smuzaffar ?). I am not sure what the risks of linking to another package in Fastsim are.\r\n\r\n[1] Actually, this is not true, #26495 also used a tool included here.", "branch": "master", "changed_files": 985, "comments": 10, "commits": 33, "created_at": "1557909983", "deletions": 1197, "labels": ["alca-pending", "analysis-pending", "code-checks-approved", "comparison-notrun", "core-pending", "db-pending", "dqm-pending", "fastsim-pending", "generators-pending", "hlt-pending", "l1-pending", "orp-pending", "pending-signatures", "reconstruction-pending", "simulation-pending", "tests-rejected", "upgrade-pending", "xpog-pending"], "milestone": "CMSSW_11_0_X", "number": 26784, "release-notes": [], "review_comments": 5, "state": "open", "title": "DQM framework: tools and header changes", "updated_at": "1557923176", "user": "schneiml"}